In [7]:
from pandas import Series, DataFrame
import pandas as pd

data = [1000,2000,3000]
index = ["메로나","구구콘","하켄다즈"]

s = Series(data=data, index=index)

s

메로나     1000
구구콘     2000
하켄다즈    3000
dtype: int64

In [9]:
#
multi = Series([31220, 33000, 32000, 32500, 32700],               
    index=["2024-04-15","2024-04-16","2024-04-17","2024-04-18","2024-04-19"])

multi

2024-04-15    31220
2024-04-16    33000
2024-04-17    32000
2024-04-18    32500
2024-04-19    32700
dtype: int64

In [11]:
multi["2024-04-17"]

32000

In [17]:
data = {"foreigner":[1,2,3,4,5,6],
        "org":[10,20,0,40,50,60],
        "private":[100,200,300,400,500,600],
        "sratio":[1,2,3,4,5,6],
        "sprice":[10,20,30,40,50,60]        
        
        }
data

frame = DataFrame(data)
frame

   foreigner  org  private  sratio  sprice
0          1   10      100       1      10
1          2   20      200       2      20
2          3    0      300       3      30
3          4   40      400       4      40
4          5   50      500       5      50
5          6   60      600       6      60

In [25]:
frame2 = DataFrame(data, columns=["private","foreigner","org","sratio","sprice"],
                   index=["2024-04-15","2024-04-16","2024-04-17","2024-04-18","2024-04-19","2024-04-20"])
frame2

            private  foreigner  org  sratio  sprice
2024-04-15      100          1   10       1      10
2024-04-16      200          2   20       2      20
2024-04-17      300          3    0       3      30
2024-04-18      400          4   40       4      40
2024-04-19      500          5   50       5      50
2024-04-20      600          6   60       6      60

In [28]:
frame2["private"]

2024-04-15    100
2024-04-16    200
2024-04-17    300
2024-04-18    400
2024-04-19    500
2024-04-20    600
Name: private, dtype: int64

In [29]:
frame2.T

,2024-04-15,2024-04-16,2024-04-17,2024-04-18,2024-04-19,2024-04-20
private,100,200,300,400,500,600
foreigner,1,2,3,4,5,6
org,10,20,0,40,50,60
sratio,1,2,3,4,5,6
sprice,10,20,30,40,50,60

In [37]:
data = {
    "종목코드":["037730","036360","005760"],
    "종목명":["3R","3SOFT","ACTS"],
    "현재가":[1510,1790,1185],
}

df = DataFrame(data)

df

     종목코드    종목명   현재가
0  037730     3R  1510
1  036360  3SOFT  1790
2  005760   ACTS  1185

In [39]:
data = [
    ["037730","036360","005760"],
    ["3R","3SOFT","ACTS"],
    [1510,1790,1185],
]

columns = ["종목코드", "종목명", "현재가"]

df2 = DataFrame(data=data, columns=columns)

df2

     종목코드     종목명     현재가
0  037730  036360  005760
1      3R   3SOFT    ACTS
2    1510    1790    1185